Revit 2024 API
ParameterTypeId.LightingFixtureWattage Property
 "Wattage Comments"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId LightingFixtureWattage { get; }
Visual Basic
Public Shared ReadOnly Property LightingFixtureWattage As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ LightingFixtureWattage {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace